Tekla Open API Reference for Tekla Structures 2025
View.ViewAttributes.MarkSymbolAttributes Property
 The view mark symbol attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public View.ViewMarkSymbolAttributes MarkSymbolAttributes { get; set; }
Public Property MarkSymbolAttributes As View.ViewMarkSymbolAttributes
	Get
	Set
Property Value
Type: View.ViewMarkSymbolAttributes
See Also
Reference
View.ViewAttributes Class
Tekla.Structures.Drawing Namespace